app/Controllers/PostController.php

SELECT *
FROM `posts`
ORDER BY `id` DESC
---
    public function index()
    {
        $posts = $this->post->orderBy('id', 'desc')->findAll();

SELECT *
FROM `posts`
WHERE `posts`.`id` = 'edit'
---
    public function show($id = null)
    {
        $post = $this->post->find($id);

INSERT INTO `posts` (`title`, `description`, `created_at`, `updated_at`) VALUES (' KJPODKASÑDKSAP', 'KJDFÑSAKDASÑKÑALDKSÑL', '2023-01-17 03:25:30', '2023-01-17 03:25:30')
---
    public function create()
    {
        $inputs = $this->validate([
            'title' => 'required|min_length[5]',
            'description' => 'required|min_length[5]',
        ]);

        if (!$inputs) {
            return view('posts/create', [
                'validation' => $this->validator
            ]);
        }

        $this->post->save([
            'title' => $this->request->getVar('title'),
            'description'  => $this->request->getVar('description')
        ]);

SELECT *
FROM `posts`
WHERE `posts`.`id` = '3'
---
    public function edit($id = null)
    {
        $post = $this->post->find($id);

UPDATE `posts` SET `title` = 'nuevo post', `description` = 'KJDFÑSAKDASÑKÑALDKSÑL', `updated_at` = '2023-01-17 03:26:07'
WHERE `posts`.`id` IN ('3')
---
    public function update($id = null)
    {
        $inputs = $this->validate([
            'title' => 'required|min_length[5]',
            'description' => 'required|min_length[5]',
        ]);

        if (!$inputs) {
            return view('posts/create', [
                'validation' => $this->validator
            ]);
        }

        $this->post->save([
            'id' => $id,
            'title' => $this->request->getVar('title'),
            'description'  => $this->request->getVar('description')
        ]);

DELETE FROM `posts`
WHERE `id` IN ('2')
---
    public function delete($id = null)
    {
        $this->post->delete($id);